{"url":"https://www.greenbelt.org.uk/artists/the-hothouse/","slug":"the-hothouse","name":"The Hot House","image":"https://s3-us-west-2.amazonaws.com/marcato.west/artists_files/web_photos/687423/original.jpg","shows":[{"title":"Getting your house in order","details":{"location":"Hot House","day":"Friday","time":"18:00"},"desc":"We&#x2019;re responding to the climate emergency. We&#x2019;re cutting down meat consumption and recycling like there&#x2019;s no tomorrow. But what about our houses? How sustainable are they? NOT! Get a wake up call from sustainable house expert Eric about the radical changes we can make to homes, short of knocking them down and starting again. Warning: it&#x2019;s about more than fitting draft excluders."},{"title":"All I Need Is The Air That I Breathe","details":{"location":"Hot House","day":"Friday","time":"19:30"},"desc":"So sang The Hollies way back when. But what if the air we breathe is under threat? How do we safeguard its future? ClientEarth believes that you fight for it in the courts. ClientEarth uses the power of the law to protect the planet and its people, as one of our most important tools in the fight against climate change, biodiversity loss and threats to human health.<br> <br> Sam Bright is a lawyer with ClientEarth where he leads their legal campaign against coal plants across Europe and beyond."},{"title":"Should People of Faith Eat Animals?","details":{"location":"Hot House","day":"Saturday","time":"16:30"},"desc":"CreatureKind founder (http://becreaturekind.org) and author of ground-breaking work on Christianity and animals, Professor David Clough asks us: What if our food choices could heal instead of hurt? Discover how to promote food justice in your local context through faith and action.<br> <br> CreatureKind&#x2019;s mission is to encourage Christians to recognise faith-based reasons for caring about the wellbeing of fellow animal creatures used for food, and to take practical action in response."},{"title":"Take Courage","details":{"location":"Hot House","day":"Sunday","time":"17:00"},"desc":"It&#x2019;s happening: culture around the climate emergency is starting to shift and we need to make this shift happen BIG TIME in our lives, our communities, in the UK and in our world. Come and share stories of hope, stories of courage, stories of inspiration about what you are doing and hear about what The Pickwell Foundation collective are up to in our community in North Devon.<br> <br> With The Pickwell Foundation"},{"title":"Does Your MP Listen To You?","details":{"location":"Hot House","day":"Sunday","time":"18:30"},"desc":"Lobbying specialists Hope for the Future share insights and case studies on how to build alliances with even the most resistant of MPs. With a proven track record transforming the hearts and minds of MPs previously with no interest in climate change, Hope for the Future will cover the practicalities of how you and your community can get the very most out of your relationship with your MP."},{"title":"Churches’ action on climate change – any earthly use?","details":{"location":"Hot House","day":"Monday","time":"16:30"},"desc":"Should congregations simply join other groups tackling climate chaos? Or is there something distinctive, influential and powerful that churches together can do? Explore what mobilising the largest community in civil society could look like.<br> <br> With A Rocha UK&#x2019;s CEO, Andy Atkins and Climate Stewards&#x2019; Director, Caroline Pomeroy."}]}