{"url":"https://www.greenbelt.org.uk/artists/ymca/","slug":"ymca","name":"YMCA","image":"https://www.greenbelt.org.uk/wp-content/uploads/2019/07/ymca.jpg","shows":[{"title":"12 – 14s Meet-up","details":{"location":"Engine","day":"Friday","time":"19:00"},"desc":"So, you made it! Here you are at Greenbelt. Perhaps you&#x2019;ve come with parents. Perhaps you&#x2019;ve come with friends. This is your space to find out what we have in store for you this weekend. From a packed workshop programme and great chill-out caf&#xE9; space &#x2013; to a whole festival for you to explore!<br> <br> In association with YMCA."},{"title":"15-17s Meet-up","details":{"location":"Engine","day":"Friday","time":"20:00"},"desc":"Here you are at Greenbelt 2019. Thanks for coming! This is your chance to find out what we have in store for you over this weekend. From workshops to your own caf&#xE9; space, and a whole festival to explore &#x2013; and perhaps even to shape!<br> <br> In association with YMCA."},{"title":"Greenbelt’s Got Talent","details":{"location":"Engine","day":"Saturday","time":"20:00"},"desc":"The mic will be free &#x2026; the amps at the ready.<br> This is your chance to entertain! Aspiring<br> musicians, spoken word artists, comedians and<br> poets. Whatever your artistic gift, this is the time<br> to demonstrate it to Greenbelt.<br> Sign up during the day in The Den to book your<br> time slot. <br> In association with YMCA."},{"title":"Tie Dye Workshop","details":{"location":"Engine","day":"Sunday","time":"13:30"},"desc":"Learn tie dying techniques and skills. *Please Bring along a white t-shirt, headband, shoe laces or anything white that you would like to up-cycle. Material to practice on will be available at the session if you would like to come along and have a go. Places are limited please book your place at the Den Youth Venue.<br> In association with YMCA"},{"title":"Greenbelt’s Got Talent","details":{"location":"Engine","day":"Sunday","time":"20:00"},"desc":"The mic will be free &#x2026; the amps at the ready.<br> This is your chance to entertain! Aspiring<br> musicians, spoken word artists, comedians and<br> poets. Whatever your artistic gift, this is the time to demonstrate it to Greenbelt.<br> Sign up during the day in The Den to book your<br> time slot. <br> <br> In association with YMCA."},{"title":"Customisation Fashion Workshop","details":{"location":"Engine","day":"Monday","time":"13:00"},"desc":"Learn how to cut/customise clothing adding personalisation and details. Learn how to create a bandana style headband or Friendship bracelet. Please bring along any old clothing, bags or accessories you would like to upcycle.<br> <br> In association with YMCA"},{"title":"Greenbelt’s Got Talent Showcase","details":{"location":"Engine","day":"Monday","time":"19:00"},"desc":"The only time that adults will be allowed in the<br> Engine! This is your time to showcase the very<br> best artistic talent to friends, family and well &#x2026;<br> the whole festival! Sign up for this special evening during our GGT evenings on Saturday &amp; Sunday.<br> 11&#x2013;17s, PLUS carers and parents<br> <br> In association with YMCA"}]}