{"url":"https://www.greenbelt.org.uk/artists/the-grove/","slug":"the-grove","name":"The Grove","image":"https://s3-us-west-2.amazonaws.com/marcato.west/artists_files/web_photos/675860/original.jpg","shows":[{"title":"Opening Ceremony","details":{"location":"Grove","day":"Friday","time":"18:00"},"desc":"All age worship to open our sacred space in the <br> Boughton landscape. Come and bless the Grove with your presence<br> <br> Lead by West Midlands Forest Church &amp; friends"},{"title":"Not so Hasty: Reflections on the wisdom of trees, imagined and real","details":{"location":"Grove","day":"Friday","time":"19:00"},"desc":"Contemplation and exploration of the wisdom we may learn from trees to inspire &#x2018;tree living&#x2019; for humans also. <br> Bring your own tree stories or poems to share.<br> <br> Lead by Genny Tunbridge and Cath Palgrave from West Midlands Forest Church. <br> <br>"},{"title":"Night Prayer: the wisdom of the past","details":{"location":"Grove","day":"Friday","time":"20:00"},"desc":"Responding to Moses&apos; encounter with YHWH at the Burning Bush &#x2013; and Elizabeth Barrett Browning&#x2019;s poem about every common bush being afire with God as a call to engage with the natural world as a site of God&#x2019;s revelation <br> <br> Led by Paul Cudby.<br> <br> A torch may help afterwards."},{"title":"Morning Prayer","details":{"location":"Grove","day":"Saturday","time":"09:00"},"desc":"Awakening: Contemplative Fire lead us in body centred reflective morning prayer."},{"title":"Wild Play for Families","details":{"location":"Grove","day":"Saturday","time":"10:00"},"desc":"Join experienced forest school facilitator Rachel Summers to explore and create as part of God&apos;s wonderful creation, enjoying each other in his company. This is where play meets worship. <br> <br> Everyone welcome, but this will be particularly <br> suitable for young children.<br>"},{"title":"Falling back in to creation: how we fell out of our ecological niche and the way back in","details":{"location":"Grove","day":"Saturday","time":"11:30"},"desc":"The Eden myth tells of an exile from earthly paradise following humanity&#x2019;s choice of abstract over relational knowledge. Industrialisation continues that fall. The way back in is through the living connections with our bodies, other people, the land and other species. Crucial to this are the edible wild plants which grow in the places we live. <br> Lead by Miles Irving."},{"title":"Peacemeal","details":{"location":"Grove","day":"Saturday","time":"12:30"},"desc":"Peacemeal sets the table for community, inclusion, justice and joy. Inspired by the &#x2018;table-example&#x2019; of Jesus, this meal is a space where all are welcomed, honoured and respected.<br> Come and bring food to share with one another.<br> Lead by South Birmingham Peacemeal"},{"title":"Witty, Wild Animals – Forest School Style","details":{"location":"Grove","day":"Saturday","time":"14:00"},"desc":"Do you know why birds have beaks and cats have claws? Learn about different animal body parts, why they are different and what they are for, then create the most bizarre and strange creatures that you can from natural materials found round the site. <br> <br> Lead by Cath Palgrave<br>"},{"title":"The Gorsedd of the Bards of the Grove of Greenbelt","details":{"location":"Grove","day":"Saturday","time":"15:00"},"desc":"Come bring your poetry, story, music and song and take part in our Bardic DIY session where you are the performers and audience. Who will be crowned this year&#x2019;s Bard?<br> <br> Lead by Steve Hollinghurst and YOU"},{"title":"Un-Earthing the Feminine Devine","details":{"location":"Grove","day":"Saturday","time":"16:30"},"desc":"Where do classic images of the divine feminine come from? Are they helpful in discovering the God in whose image we are made male and female? An exploration of ideas/experience of the divine feminine in ancient and contemporary contexts. <br> Lead by Steve &amp; Anne Hollinghurst<br>"}]}