{"url":"https://www.greenbelt.org.uk/artists/festival-friends/","slug":"festival-friends","name":"Festival Friends","image":"https://s3-us-west-2.amazonaws.com/marcato.west/artists_files/web_photos/697226/original.jpg","shows":[{"title":"Meet Someone New","details":{"location":"Jesus Arms","day":"Saturday","time":"19:00"},"desc":"Drink, chat and relax with other single Greenbelters. Bring a friend, or come on your own. You never know who you might meet!<br> <br> In association with Christian Connection"},{"title":"Event Horizon: Faith In The Future","details":{"location":"Shelter","day":"Saturday","time":"14:00"},"desc":"The world&#x2019;s religions have stories about the way the future will go. Those different stories and how literally we take them can have profound implications for our living together in the present. Join a panel of thinkers from different faith traditions &#x2013; and an agnostic &#x2013; as together they look forward to the present.<br> <br> With Moeen Yaseen (Global Vision 2000, independent Islamic think tank), Rachel Searle (expert on William Blake and the relevance of Jerusalem), Leah Levane (co-chair of Jewish Voice for Labour), Clive Menzies (Critical Thinking) and chaired by longterm Greenbelter and Economics Professor Simon Mouatt"},{"title":"Jesus: Teacher, Maverick, Comedian. Or Just All Round Good Guy?","details":{"location":"Engine","day":"Monday","time":"12:00"},"desc":"A fun and interactive opportunity to listen to, engage with, reimagine or reinterpret some of the weird and wonderful stories Jesus told.<br> <br> With founder of the Sacred Bean Coffee Company and pioneer minister, Darren Howie"},{"title":"Including the 40% single","details":{"location":"Forge","day":"Monday","time":"10:00"},"desc":"40% of society is single. But in our churches, it&apos;s much lower. How can we reach out to single people in our communities and ensure that they are welcomed and included in church? Led by Dr David Pullinger of Single Friendly Church, come along to get informed and inspired to take positive action.<br> <br> Brought to you by Single Friendly Church"}]}