{"url":"https://www.greenbelt.org.uk/artists/christian-solidarity-worldwide/","slug":"christian-solidarity-worldwide","name":"CSW","image":"https://www.greenbelt.org.uk/wp-content/uploads/2019/07/CSW.jpg","twitter":"https://twitter.com/CSW_UK","shows":[{"title":"What does it mean to love our neighbour?","details":{"location":"Treehouse","day":"Saturday","time":"16:45"},"desc":"Mervyn Thomas CMG in conversation with Sarah Snyder<br> <br> When we look deeply into the parable of the Good Samaritan, we are confronted by a picture of radical love for those in need. Come and explore what it means to answer the compelling and Christ-like call to transcend conventions and show love to those who aren&#x2019;t &#x2018;like us&#x2019;. <br> <br> Mervyn Thomas CMG is the founder and CEO of CSW, a Christian human rights organisation advocating for freedom of religion and belief around the world.<br> <br> In assoc. with CSW"},{"title":"Love Letters","details":{"location":"Forge","day":"Sunday","time":"16:00"},"desc":"with Jessica Dalton and Dave Mance <br> <br> Join CSW for family-friendly craftivism! This summer they want to send 1,000 letters of solidarity to those suffering for their faith around the world. CSW&#x2019;s campaign team will share stories of the amazing power of a letter and invite you to get creative, personal and powerful in making and writing cards.<br> <br> In association with CSW. <br> <br> CSW is a Christian human rights organisation advocating for freedom of religion or belief around the world."},{"title":"How Not To Burn Out On The Frontline","details":{"location":"Foundry","day":"Monday","time":"14:00"},"desc":"Come and talk to &#x201C;Jane&quot; about how she manages the relentless nature of her intense advocacy work and the potential for burn-out and compassion fatigue. Her story is true for all of us working and serving on the &#x2018;frontline&apos; against injustice, wherever we are. This conversation is for all those feeling ground-down in the &apos;good fight&apos;.<br> <br> &#x201C;Jane&#x201D; is an advocate working with oppressed religious minorities where, every day, she works with men and women of all faiths and none who live under the threat of torture, imprisonment and death because of what they believe. There are security restrictions for this talk, please do not use any kind of recording or electronic device and do not publish content on social media or make public the content of this talk in any way.<br> <br> In association with CSW"}]}