{"url":"https://www.greenbelt.org.uk/artists/the-nanas/","slug":"the-nanas","name":"The Anti Fracking Nanas","image":"https://s3-us-west-2.amazonaws.com/marcato.west/artists_files/web_photos/669683/original.jpg","twitter":"https://twitter.com/UK_Nanas","shows":[{"title":"Creative Climate Activism For All Ages","details":{"location":"Hot House","day":"Saturday","time":"10:45"},"desc":"Join Lancashire&#x2019;s most feisty and fun Grandmas as they host an all-age workshop on how to take action and make a difference where you are in the face of climate emergency. Proving that you&#x2019;re never too old (or too young) to make a difference, The Nanas get stuck into the big issues of the day with good humour and good grace, aprons on and oven gloves at the ready. For all the family, if you&#x2019;ve never campaigned before, this is for you. Because now is the time."},{"title":"Creative Climate Activism For All Ages","details":{"location":"Hot House","day":"Monday","time":"10:30"},"desc":"Join &apos;Nanas from Lancashire&apos; - the feisty Grandmas and friends from Youth Strike 4 Climate will host an all-age workshop on how to take action and make a difference in the face of climate emergency. With a focus on finding the joy in the actions whilst making an impact on many levels and proving that you&apos;re never too old (or too young) to make a difference (in fact, it helps and is what activism has been missing!) The Nanas get stuck into the big issues of the day with good humour and good grace, aprons on and oven gloves at the ready. For all the family, if you&apos;ve never campaigned before, this is for you. Because now is the time and you have amazing abilities you haven&apos;t yet discovered."},{"title":"Resist to Exist","details":{"location":"Pagoda","day":"Monday","time":"15:30"},"desc":"There is a long history of citizens resisting injustice by withdrawing aspects of their legal cooperation with the State. This panel debates the ethics of civil disobedience and asks: is it ever OK to break the law if the law is meant to protect and defend our rights? From the Palestinians of Beit Sahour withholding their taxes during the first intifada to Extinction Rebellion blocking London bridges today, what are the rights and wrongs of being civilly disobedient?<br> <br> With Skeena Rathor (Co-ordinator of XRs Vision Sensing Team and member of XRs Political Circle), The Fracking Nanas, The Bishop of Chelmsford, Stephen Cottrell (who spoke on behalf of the Stansted 15 in court), Ruth Jarman (Christian Climate Action), and chaired by Greenbelt trustee Rhian Roberts"},{"title":"So where do we go from here?","details":{"location":"Hot House","day":"Monday","time":"18:00"},"desc":"We&#x2019;ve partied. We&#x2019;ve protested. But what do we do now with all that we&#x2019;ve wrestled with this weekend on the climate catastrophe that faces us if we just stick to business as usual? As we head back to our communities and workaday lives, how can we stay strong and part of this movement for positive and urgent change? Group hug? It needs to be more than that.<br> <br> With Extinction Rebellion, The Anti-Fracking Nanas, Jo Chambelain from Christian Aid, and Ruth Jarman from Christian Climate Action."}]}