{"url":"https://www.greenbelt.org.uk/artists/space-to-breathe/","slug":"space-to-breathe","name":"Space to Breathe","image":"https://www.greenbelt.org.uk/wp-content/uploads/2019/07/space-to-breathe.jpg","twitter":"https://twitter.com/space2breathe","shows":[{"title":"Sshh: Laugh or Cry","details":{"location":"Shelter","day":"Saturday","time":"15:30"},"desc":"A session thinking about perspective and acceptance.<br> <br> Andy Freeman and Nicky Redsell from Space to Breathe host these daily doses of everyday spirituaity and imagination. The Adjacent Possible explores the idea that new opportunities and steps in our imagination are often just through the next open door. Expect ambient music, words and images and creative reflections all with a non-religious and contemporary vibe."},{"title":"Proost Presents… Roadside Stories","details":{"location":"Shelter","day":"Saturday","time":"20:00"},"desc":"The Proost team share more poetry, music and creativity from their unique brand of &quot;art with soul.&quot;  Featuring Jonny Baker, Emily Garces, Steve Leach and a host other Proost regulars, this interactive experience will bring wisdom for the journey and hope for the future.  You can find out more about Proost at www.proost.co.uk. <br> Proost are part of Space to Breathe."},{"title":"Sshh: Wise and Wonder-ful","details":{"location":"Shelter","day":"Sunday","time":"15:30"},"desc":"A session considering how we build resilience, taking inspiration from each other &amp; the world around us.<br> <br> Andy Freeman and Nicky Redsell from Space to Breathe host these daily doses of everyday spirituaity and imagination. The Adjacent Possible explores the idea that new opportunities and steps in our imagination are often just through the next open door.  Expect ambient music, words and images and creative reflections all with a non-religious and contemporary vibe."},{"title":"Sshh: Divine Comedy","details":{"location":"Shelter","day":"Monday","time":"16:00"},"desc":"A session on understanding vocation and finding meaning in our lives.<br> <br> Andy Freeman and Nicky Redsell from Space to Breathe host these daily doses of everyday spirituaity and imagination. The Adjacent Possible explores the idea that new opportunities and steps in our imagination are often just through the next open door.  Expect ambient music, words and images and creative reflections all with a non-religious and contemporary vibe."}]}