{"url":"https://www.greenbelt.org.uk/artists/rachel-mann/","slug":"rachel-mann","name":"Rachel Mann","image":"https://s3-us-west-2.amazonaws.com/marcato.west/artists_files/web_photos/675643/original.jpg","twitter":"http://www.twitter.com/revrachelmann","shows":[{"title":"Communion","details":{"location":"Glade Big Top","day":"Sunday","time":"09:30"},"desc":"Ah Christmas time, mistletoe and wine... no, we&#x2019;re afraid Sir Cliff isn&#x2019;t joining us this year, but in his absence we&#x2019;re pulling out all our Christmas crackers, and laying on a feast. <br> <br> The way we read and tell the Christmas story is so often sentimentalised, and sugary. But at heart it&#x2019;s a story of revolution and insurgency. The story of the peasant baby that threatened an empire. So this year we&#x2019;ll be tugging the tail of our own empire state of mind, and &#x2018;re-membering&#x2019; Christmas together. <br> <br> Our service will incorporate some familiar aspects of the British Christmas, including the Nativity Play, the Queen&#x2019;s Speech, andeven a lovely Carol (thanks for coming Carol!) <br> <br> For our Christmas Dinner, we&#x2019;ll share the very basic elements of bread and wine, common to cultures around the world. Gluten free and non-alcoholic options will of course be available, please bring a cup.<br> <br> It would be extraordinary if we were to neglect to remember the present day reality of the &#x2018;little town&#x2019; of Jesus&#x2019; birth, a placewhere people still know occupation and oppression, so yes Palestine will also feature in our service. Our music will be led by DJ and Percussionist Sekrit with Mishael Lazarus on vocals. We will be joined by a cast of colourful characters (human and non-human), including John Bell, Liz Adekunle, Sami Awad, Nadia Bolz-Weber. And an angel.<br> <br> Dress for the season if you wish, but otherwise, just come as you are: and be ready for one or two surprises.<br> <br> Gather from 9.30 onward for Christmas party fun and games with Christian Aid and from 10.00 onward for music and warm-ups for a 10.30 service start time. And watch out for the Christmas characters around site."},{"title":"Michael Ramsey Prize Giving","details":{"location":"Glade Big Top","day":"Sunday","time":"12:00"},"desc":"Archbishop of Canterbury Justin Welby reveals the winner of the Michael Ramsey Prize 2019. <br> <br> Hear from the judges why theology matters to them, and how this inspired the selection of the six short-listed book titles chosen for their contribution to contemporary theology."},{"title":"A Shameless Conversation #2","details":{"location":"Glade Big Top","day":"Monday","time":"11:30"},"desc":"Lutheran pastor and writer Nadia Bolz-Weber chews the fat with priest and poet Rachel Mann<br> <br> Just why has the church got its proverbial knickers in such a twist about human sexuality above all else all these centuries? Isn&#x2019;t it time we all got over it? Isn&#x2019;t it time for a second Reformation that turns sexual harm into sexual healing?<br> <br> Expect wit, wisdom, love, laughter. And a whole new, holistic way of seeing yourself in church and before God.<br> <br> With the generous support of Canterbury Press and Modern Church."},{"title":"Bleak Winters, Future Hope – Why Christina Rossetti Still Matters Today","details":{"location":"Leaves","day":"Monday","time":"15:30"},"desc":"If most people know Christina Rossetti&apos;s &apos;In the Bleak Midwinter&apos;, fewer appreciate the range and depth of her poetry. Join Rachel Mann, as she explores how Rossetti speaks into modern anxieties and what kind of hope God offers to us.<br> <br> Rachel Mann is a priest, poet and theologian. Her books include &#x2018;In the Bleak Midwinter&#x2019;, published this summer."}]}