{"url":"https://www.greenbelt.org.uk/artists/joshua-coombes/","slug":"joshua-coombes","name":"Joshua Coombes","image":"https://s3-us-west-2.amazonaws.com/marcato.west/artists_files/web_photos/691031/original.jpg","shows":[{"title":"Do Something For Nothing","details":{"location":"Engine","day":"Saturday","time":"16:00"},"desc":"When hairdresser Joshua Coombes started cutting hair for people experiencing homelessness on the streets, he found a way of making a difference by doing something he loved. Now, his social campaign #DoSomethingForNothing has gone viral. Come and hear his story and think about what you could do to change the world where you live."},{"title":"Market Disrupters","details":{"location":"Exchange","day":"Saturday","time":"18:30"},"desc":"With Monzo, NextMeal and Do Something For Nothing<br> <br> Come and hear the amazing stories of people looking to do things differently in their areas of work. From Monzo in the personal finance and banking world to the NextMeal App in the street homelessness response environment and Joshua Coombes&#x2019; &#x2018;Do Something For Nothing&#x2019; compassion and connection response. All challenge the status quo. All show that there is &#x2018;another way&#x2019;."},{"title":"Do Something for Nothing: The Power of Human Connection","details":{"location":"Treehouse","day":"Saturday","time":"11:00"},"desc":"Overwhelmed by the everyday reality and scale of homelessness on the streets of the capital city where he lived and worked, Joshua Coombes, a hairdresser by profession decided to do something simple, direct and powerful. He decided to connect and show compassion by offering to cut hair for homeless people out on the streets, where they were. This decision transformed his life and many of the lives of those whose hair he cut.<br> <br> Joshua Coombes is the founder of #DoSomethingForNothing &apos;movement&apos;, a global conspiracy of people committed to acts of human kindness and compassion where they live, who share their stories via the hashtag"}]}