{"url":"https://www.greenbelt.org.uk/artists/urc/","slug":"urc","name":"URC","image":"https://www.greenbelt.org.uk/wp-content/uploads/2019/07/URC.jpg","shows":[{"title":"Be More Snail","details":{"location":"The Great Outdoors","day":"Saturday","time":"12:15"},"desc":"Leaving from outside Shelter <br> Snails: the ultimate culture-changer, digesting debris and creating the conditions for new life. We invite you to discover your inner snail.<br> <br> Discover wit and wisdom from the ground level by joining the pop-up URC walking liturgies as we explore how to carry our real home with us, leave a trail of shining joy, and savour going more slowly. Todays walk will look at unpacking what we carry with us and what is &#x2018;home&#x2019;."},{"title":"The Laugh Temptation: Is Everything Funny? Or Are Some Things Off-Limits?","details":{"location":"Pagoda","day":"Saturday","time":"18:45"},"desc":"Forty years ago this autumn, churches were picketing Monty Python&#x2019;s Life of Brian. Now university campuses ask comedians to sign agreements not to touch on a range of issues before taking gigs. A panel of comedy practitioners and fans debate whether there are any taboos in comedy or whether everything should be fair game.<br> With comedian Elf Lyons, comedy booker Helen Tomblin, comedy writer James Cary<br> and chaired by Steve Tomkins, editor of Reform,  the magazine of the URC<br> <br> In association with the URC"},{"title":"Cake and Debate: Aliens","details":{"location":"Engine","day":"Saturday","time":"18:00"},"desc":"Welcome back to another year of cake and debate! This year&#x2019;s gameshow will be Catchphrase and there will be prizes! Come along and debate the hot topics this year, while eating some delicious cake! This theme is taking on what it is like to be an alien in another country: what rights should we have, and what support should we receive? Come and have your say!<br> <br> In association with URC."},{"title":"The Parish Inquisition","details":{"location":"Jesus Arms","day":"Sunday","time":"13:00"},"desc":"No one expects the Greenbelt church history pub quiz! Test your wits and (wisdoms) as we find out who knows their Calvin from their Hobbes and their St Arsenius from their elbow. Presented by Steve Tomkins, editor of the URC&#x2019;s magazine Reform. Prizes! Questions! Answers! Beer!<br> <br> In association with URC."},{"title":"Cake and Debate: Habitat","details":{"location":"Engine","day":"Sunday","time":"18:00"},"desc":"Welcome back to another year of cake and debate! This year&#x2019;s gameshow will be Catchphrase and there will be prizes! Come along and debate the hot topics this year, while eating some delicious cake! <br> <br> This debate looks at the the climate crisis: Is it each person&#x2019;s responsibility? Or should it be the big companies? And how do we go about changing people&#x2019;s minds about it? Come and have your say!<br> <br> In association with URC."},{"title":"Be More Snail","details":{"location":"The Great Outdoors","day":"Sunday","time":"18:15"},"desc":"Leaving from outside Shelter <br> Snails: the ultimate culture-changer, digesting debris and creating the conditions for new life. We invite you to discover your inner snail.<br> <br> Discover wit and wisdom from the ground level by joining the pop-up URC walking liturgies as we explore how to carry our real home with us, leave a trail of shining joy, and savour going more slowly. Todays walk will look at how to leave a trail to nourish others and show the way."},{"title":"Cake and Debate: Revolution","details":{"location":"Engine","day":"Monday","time":"18:00"},"desc":"Welcome back to another year of cake and debate! This year&#x2019;s gameshow will be Catchphrase and there will be prizes! Come along and debate the hot topics this year, while eating some delicious cake! <br> <br> This debate is all about civil disobedience and rising up against an unjust and unfair government, and the best ways to stand against an unjust society. Violence or peaceful protest? Come and have your say!<br> <br> In association with URC"},{"title":"Be More Snail","details":{"location":"The Great Outdoors","day":"Monday","time":"12:15"},"desc":"Leaving from outside Shelter <br> Snails: the ultimate culture-changer, digesting debris and creating the conditions for new life. We invite you to discover your inner snail.<br> <br> Discover wit and wisdom from the ground level by joining the pop-up URC walking liturgies as we explore how to carry our real home with us, leave a trail of shining joy, and savour going more slowly. <br> <br> Todays walk will be the ultimate go-slow: a mindful Eucharist."}]}