{"url":"https://www.greenbelt.org.uk/artists/amirah-sackett/","slug":"amirah-sackett","name":"Amirah Sackett","image":"https://s3-us-west-2.amazonaws.com/marcato.west/artists_files/web_photos/670312/original.jpg","shows":[{"title":"It’s Not About the Burqa","details":{"location":"Treehouse","day":"Friday","time":"17:30"},"desc":"Fed up of hearing about what Muslim women were like from people who were neither Muslim nor female, Mariam Khan edited a book of essays, It&#x2019;s Not About The Burqa, to bring together the voices of a variety of Muslim women &#x2013; all angry at the lazy stereotyping &#x2013; to tell their stories. She is joined by one of the key contributors, Yassmin Abdel-Magied.<br> <br> Mariam Khan is a writer and activist on issues of feminism and Islam. Yassmin is a Sudanese-born author, broadcaster, social advocate and digital influencer. They will be in conversation with Chicago-based choreographer Amirah Sackett.<br> <br> Supported by Amal &#x2013; A Sa&#xEF;d Foundation Programme"},{"title":"Love Embraces All (and other works)","details":{"location":"Playhouse","day":"Saturday","time":"16:45"},"desc":"Through the poetry of the Sufi mystic Rumi, interpreted by Aja Black (The Reminders), and with sound design by Chicago DJ Nevin Hersch, Sackett&#x2019;s new solo work explores the barriers we create within ourselves and the walls that others build around us. A heartfelt appeal to always choose love.<br> Age Recommendation: 8+<br> Duration: 60 mins<br> <br> An internationally-recognised hip-hop dancer, choreographer, and teacher, Amirah Sackett explores her Muslim American identity through combining hip-hop movement and Islamic themes.<br> Running Time: 60 mins<br> Age Recommendation: 8+<br> Supported by Amal &#x2013; A Sa&#xEF;d Foundation Programme"},{"title":"Hip Hop Workshop","details":{"location":"Forge","day":"Sunday","time":"14:00"},"desc":"Join Amirah in an exploration of physical movement in hip-hop culture. Learn more about hip-hop history and culture, as well as foundational movement styles of top-rocking, breaking, popping, and tutting. Come prepared to move in comfortable clothes and clean sneakers.<br> <br> An internationally-recognised hip-hop dancer, choreographer, and teacher, Amirah Sackett explores her Muslim American identity through combining hip-hop movement and Islamic themes.<br> <br> Supported by Amal &#x2013; A Sa&#xEF;d Foundation Programme"},{"title":"The Daily Mirror","details":{"location":"Treehouse","day":"Monday","time":"12:30"},"desc":"Featuring the festival&#x2019;s smartest thinkers, artists and activists, including you! Cole Moreton helps us look beyond the headlines to try and work out what&#x2019;s really going on in the world. Come prepared to listen, laugh and have your say."}]}