{"url":"https://www.greenbelt.org.uk/artists/ms-mohammed/","slug":"ms-mohammed","name":"Ms. Mohammed","image":"https://s3-us-west-2.amazonaws.com/marcato.west/artists_files/web_photos/685439/original.jpg","twitter":"https://twitter.com/MsMohammedMusic","shows":[{"title":"Ms. Mohammed","details":{"location":"Engine","day":"Sunday","time":"16:00"},"desc":"Spend some time with one of the UK&#x2019;s most radical and intersting music artist-activists, Ms. Mohammed. Adopting her name in defiance at the way the world was going (austerity, Brexit, the #MuslimBan and the rise of the far right), the surprise is that she isn&#x2019;t a Muslim &#x2013; and both her parents are Christians. Go figure! And come and find out more."},{"title":"Ms. Mohammed","details":{"location":"Little Big Top","day":"Sunday","time":"12:35"},"desc":"Born in Trinidad of Indian descent, Ms. Mohammed makes a daring mix of bluesy punk soul and indie guitar music. Uniting us to celebrate our similarities as well as our differences, she gives the Riot Girl movement a modern-day twist. In the face of austerity, Brexit, the #MuslimBan and rise of the far right, Ms Mohammed uses her art to combat prejudice.<br> <br> ------------------------<br> <br> Part of the Dream Nails Takeover programme where we say......GIRLS TO THE FRONT!<br> <br> Take up space!<br> <br> All public &#x2013; and even private &#x2013; spaces are dominated by men. Women and non-binary people taking back space is a radical act of liberation.<br> <br> Women and non-binary people: Our songs are for you. Everyone is welcome at our shows, but we don&#x2019;t write feminist music just so men can block your view!<br> <br> After every single show, women and non-binary people tell us how much they appreciate being in a space where they can dance and have fun together. We say &#x2018;Girls to the front&#x2019; in honour of our Riot Grrrl fore-sisters, but we really mean&#x2026;<br> <br> Men to the back!<br> <br> We didn&#x2019;t spend years at shows growing up (unable to see, groped and violently pushed) to recreate the same feelings in our female fans. All our male fans stand at the back, in a small but vital act of allyship.<br> <br> Hopefully one day we won&#x2019;t have to say it any more. Hopefully one day we&#x2019;ll live in a world where male entitlement no longer exists, and where women feel truly safe.<br> <br> But until that world is built from our blood, sweat and bare hands&#x2026;<br> <br> GIRLS TO THE FRONT!"}]}