{"url":"https://www.greenbelt.org.uk/artists/christian-aid/","slug":"christian-aid","name":"Christian Aid","image":"https://www.greenbelt.org.uk/wp-content/uploads/2019/07/CAid.jpg","twitter":"https://www.greenbelt.org.uk/organisations/christian-aid/","shows":[{"title":"Bedtime Stories for Grown-Ups","details":{"location":"Christian Aid Presents&#x2026;","day":"Friday","time":"20:45"},"desc":"Round off your day with a bedtime story, and go to bed with a call for justice ringing in your ears. Buy your hot chocolate from the caf&#xE9;, settle down, and bring your teddy if you like!"},{"title":"Preview Party","details":{"location":"Christian Aid Presents&#x2026;","day":"Friday","time":"19:00"},"desc":"Welcome to Greenbelt 2019! We&#x2019;re delighted to host a reception for our incredible supporters. Join us to take a sneak peek at this year&#x2019;s fabulous programme, meet our team, and talk to other supporters as we celebrate the power of you &#x2013; our amazing changemakers."},{"title":"Celtic Morning Prayer","details":{"location":"Christian Aid Presents&#x2026;","day":"Saturday","time":"09:30"},"desc":"Start your day with the Almighty, with morning prayer led by the Northumbria Community."},{"title":"Debate: Is international development racist?","details":{"location":"Christian Aid Presents&#x2026;","day":"Saturday","time":"10:00"},"desc":"We want to help the poor, but do white western NGOs perpetuate racist stereotypes, or worse, perpetuate structural inequalities in the way they do development? Join the debate with our panellists: researcher, blogger and journalist Dr Edward Ademolu; and Christian Aid&#x2019;s Chine McDonald. <br> <br> There&#x2019;s more conversation about &#x2018;white saviours&#x2019; with USPG on Sunday at 5.00pm in The Treehouse."},{"title":"L’Arche: working for a world where all belong","details":{"location":"Christian Aid Presents&#x2026;","day":"Saturday","time":"11:00"},"desc":"L&#x2019;Arche communities are places where people with and without learning disabilities can discover who they are, not just what they can do. Led by Amy Merone and members of the L&#x2019;Arche community, this is a chance for us to encounter one another and share each other&#x2019;s stories."},{"title":"Building Alternative Feminist Futures","details":{"location":"Christian Aid Presents&#x2026;","day":"Saturday","time":"12:00"},"desc":"Why we still need to tackle patriarchy and other systems of oppressions in order to build truly transformative societies &#x2013; and not just in our overseas programmes.<br> <br> With Sophie Efange from Christian Aid"},{"title":"We are earthbound","details":{"location":"Christian Aid Presents&#x2026;","day":"Saturday","time":"13:00"},"desc":"Earth is the one place we know that supports life. It is from this dust that we emerged, and to this dust that we will return. We are earthbound. How will we make ourselves a lasting home on this one planet, in ways that provide a fair share to every human being? How will we do that without destroying non-human life, or disrupting the earth&#x2019;s systems that we depend on?<br> <br> With author and blogger Jeremy Williams"},{"title":"Collective Take Over","details":{"location":"Christian Aid Presents&#x2026;","day":"Saturday","time":"14:00"},"desc":"For two hours, the power belongs to the young. Be inspired by the wisdom of youth. These two hours will be led by young people, but  this is for everyone who&#x2019;s willing to be challenged by a different insight.<br> <br> 2pm: The Wisdom of Youth <br> <br> Ever wondered what it takes to be an activist and how you can create change? Come and listen to the inspiring stories of our panel of young campaigners. All between the ages of 16-30, hear about what motivates them to be agents of change, the challenges they&#x2019;ve faced and how they&#x2019;ve overcome obstacles in their way.<br> <br> 3pm: &#x2018;Are you sitting uncomfortably?... Good&#x2019; <br> <br> &#x2018;The Climate movement is White Middle Class&#x2019;&#x2026;. Social Movements are at the heart of new power &#x2013; but to be truly revolutionary they need to be truly diverse. We will explore how we can truly embody the revolution by embracing and ensuring difference in our movements."},{"title":"Protest Placard Making Workshop","details":{"location":"Christian Aid Presents&#x2026;","day":"Saturday","time":"16:00"},"desc":"Bradford-based community artist, Katie Jones, leads our hands-on workshop making placards to give voice to our protest. We&#x2019;ll be gathering with the placards we make when we assemble on Monday at midday to call for urgent action on climate change."},{"title":"Songs of Wit and Wisdom: challenging power and privilege","details":{"location":"Christian Aid Presents&#x2026;","day":"Saturday","time":"17:00"},"desc":"Our artists-in-residence, Roo and Sax, will sing away racism, sexism and classism with songs of the anti-apartheid movement, feminist retellings of old folk songs, and classic workers&#x2019; anthems."}]}