{"url":"https://www.greenbelt.org.uk/artists/bishop-stephen-cottrell/","slug":"bishop-stephen-cottrell","name":"Bishop Stephen Cottrell","image":"https://s3-us-west-2.amazonaws.com/marcato.west/artists_files/web_photos/692779/original.jpg","shows":[{"title":"Is Church History?","details":{"location":"Pagoda","day":"Monday","time":"12:30"},"desc":"The numbers aren&apos;t great. When only 1% of under 24&#x2019;s identify with the Church of England, it&#x2019;s no surprise some people say it&apos;s had its day. But how do you take the pulse of a body like a church? What&#x2019;s your take? Several witnesses tell us about their experience of a church that seems to be alive&#x2026;&#xA0;others tell us of where it seems to have popped its clogs.<br> <br> Revd Liz Adekunle, Archdeacon of Hackney, Mads Davies of the Church Times, Stephen Cottrell, Bishop of Chelmsford and Revd Kate Bottley, Vicar off the Telly, tell us about what kind of church might be emerging, a story of adaptation and creativity not just decline and fall.&#xA0;Chaired by Martin Wroe, co-author of Lifelines, Notes on Life &amp; Love, Faith &amp; Doubt."},{"title":"Resist to Exist","details":{"location":"Pagoda","day":"Monday","time":"15:30"},"desc":"There is a long history of citizens resisting injustice by withdrawing aspects of their legal cooperation with the State. This panel debates the ethics of civil disobedience and asks: is it ever OK to break the law if the law is meant to protect and defend our rights? From the Palestinians of Beit Sahour withholding their taxes during the first intifada to Extinction Rebellion blocking London bridges today, what are the rights and wrongs of being civilly disobedient?<br> <br> With Skeena Rathor (Co-ordinator of XRs Vision Sensing Team and member of XRs Political Circle), The Fracking Nanas, The Bishop of Chelmsford, Stephen Cottrell (who spoke on behalf of the Stansted 15 in court), Ruth Jarman (Christian Climate Action), and chaired by Greenbelt trustee Rhian Roberts"}]}