{"url":"https://www.greenbelt.org.uk/artists/the-exchange-hosted-by/","slug":"the-exchange-hosted-by","name":"The Exchange hosted by….","image":"https://www.greenbelt.org.uk/wp-content/uploads/2019/07/exchange2.jpg","shows":[{"title":"Food Retail, Food Justice","details":{"location":"Exchange","day":"Friday","time":"17:30"},"desc":"With Hannah Gallimore, Corporate Responsibility Manager, Central England Co-op &amp; Simone Connolly, Director, FareShare East Midlands. <br> <br> Working with food banks and charities, Central England Co-operative and FareShare East Midlands provide a solution that tackles food waste as well as helping people to get the support they need, when they need it. Find out about their sustainable approach to cutting waste and helping their communities.<br> In association with Central England Co-op"},{"title":"What Is Business For?","details":{"location":"Exchange","day":"Friday","time":"19:00"},"desc":"With Peter Holbrook, Social Enterprise UK<br> What is business for? What role does it play in human flourishing? And what does it mean for a business to have a social purpose? In a context of climate emergency and growing inequality, what role can business play?<br> In association with Anthony Collins Solicitors"},{"title":"Entrepreneurs Recreating 3rd Spaces","details":{"location":"Exchange","day":"Friday","time":"20:15"},"desc":"Hosted by Jonny Baker and church pioneers involved social enterprise<br> <br> Come and hear inspiring stories of buildings being repurposed to create well-used community resources and gathering points, which are both income-generating and sustainable.  Come with your ideas and questions to put to the panel and share with other practitioners.<br> <br> In association with CMS Pioneer Network"},{"title":"A Party For Food Justice","details":{"location":"Exchange","day":"Saturday","time":"09:30"},"desc":"With James Butler, Campaigns Officer, the Co-operative Party<br> Come and learn about the Co-operative Party&#x2019;s new campaign to achieve food justice by campaigning for change, nationally and locally. Their aim is to tackle hunger and ensure everyone in the UK is able to make healthy food choices.<br> In association with Central England Co-op"},{"title":"Innovators Reframing Spirituality","details":{"location":"Exchange","day":"Saturday","time":"11:00"},"desc":"Hosted by Jonny Baker and church pioneers involved social enterprises<br> <br> As people increasingly describe themselves as spiritual and not religious, hear stories of spirituality being reframed in creative ways to generate successful social enterprise. What ideas and resources do you have to play with in your locality or network of relationships?<br> <br> In association with CMS Pioneer Network"},{"title":"Values On The High Street: Is It Possible To Run A Retail Business And Do Good?","details":{"location":"Exchange","day":"Saturday","time":"12:30"},"desc":"With Debbie Robinson, CEO of Central England Co-operative.<br> <br> Hear about a retailer who tries to be about more than just profit as we ask whether it is possible to run a High Street retail business and do good. What does it mean for a shop to have a positive ethos? Can we temper consumerism with good intentions?<br> <br> In association with Anthony Collins Solicitors"},{"title":"A Drop In The Ocean?","details":{"location":"Exchange","day":"Saturday","time":"14:00"},"desc":"How individual&#x2019;s savings have changed communities.<br> <br> Come and hear inspirational stories of change and transformation from Resonance&#x2019;s partners who have used community investment to secure local assets for future generations, making space for vulnerable people, fresh starts for refugees, and renewable energy projects that support long-term well-being. <br> <br> In association with Resonance."},{"title":"Principles And Commerce: The Hard And Narrow Road","details":{"location":"Exchange","day":"Saturday","time":"17:00"},"desc":"With Robin Roth, CEO of Traidcraft PLC <br> <br> Hear the &#x2018;warts and all&#x2019; story of the first 40 years of Traidcraft&#x2019;s journey as fair trade pioneers &#x2013; the successes, the innovations, and, just as importantly, the failures and mistakes of trying to put the principles of fair trade into commercial practice. How the spirituality of good business can mean seeming failure and near-death leading to rebirth and new life.<br> <br> In association with Traidcraft  PLC"},{"title":"“It’s all your Fault!”","details":{"location":"Exchange","day":"Sunday","time":"18:30"},"desc":"So claimed the wonderful matriarchal character in the final episode of Russell T Davies&#x2019; near-future TV dystopia, Years and Years. While it&#x2019;s easy for the young to rail at their predecessors and for us all to point at the self-interest of big business in despoiling our planet, her accusation was that we are all complicit.  Was this just an awful truth, or a prophetic voice calling us to play an intentional part in the story to come?<br> <br> With Cliff Mills of Anthony Collins Solicitors and Daniel Tomlinson of the Resolution Foundation"},{"title":"Pioneers reimagining a better world","details":{"location":"Exchange","day":"Monday","time":"12:30"},"desc":"Hosted by Jonny Baker and church pioneers involved social enterprises<br> <br> Stories of how wanting to right a wrong has led to the creation of a social enterprise that both challenges the status quo and makes good business sense.  Maybe what gets you riled up, could be the start of the change you long to see!<br> <br> In association with CMS Pioneer Network"}]}