{"url":"https://www.greenbelt.org.uk/artists/padraig-o-tuama/","slug":"padraig-o-tuama","name":"Pádraig Ó Tuama","image":"https://s3-us-west-2.amazonaws.com/marcato.west/artists_files/web_photos/675633/original.jpg","twitter":"https://twitter.com/duanalla","shows":[{"title":"Tenx9: SHOCK","details":{"location":"Leaves","day":"Friday","time":"19:30"},"desc":"Tenx9 is a storytelling event that originated in Belfast, where people tell true stories from their own lives. At Greenbelt we&apos;ll hear six festivalgoers talk for about nine minutes each: funny, true stories from their own lives of a time when they were shocked. Shocked at what happened, shocked at what they could achieve, shocked at what someone said. <br> <br> (If you&#x2019;d like to be a late consideration to tell a story, tweet @tenx9 and check out the editorial guidelines on tenx9.com)<br> <br> P&#xE1;draig &#xD3; Tuama is a poet and theologian from Ireland. He led Corrymeela, Ireland&#x2019;s oldest peace and reconciliation organisation, from 2014 to 2019"},{"title":"A Shameless Conversation #1","details":{"location":"Glade Big Top","day":"Saturday","time":"10:30"},"desc":"Lutheran pastor and writer Nadia Bolz Weber chews the fat with her old friend P&#xE1;draig &#xD3; Tuama<br> <br> Just why has the church got its proverbial knickers in such a twist about human sexuality above all else all these centuries? Isn&#x2019;t it time we all got over it? Isn&#x2019;t it time for a second Reformation that turns sexual harm into sexual healing?<br> <br> Expect wit, wisdom, love, laughter. And a whole new, holistic way of seeing yourself in church and before God.<br> <br> With the generous support of Canterbury Press and Modern Church."},{"title":"Storying with L’Arche","details":{"location":"Shelter","day":"Saturday","time":"12:30"},"desc":"Join us for a conversation about storytelling with poet and theologian P&#xE1;draig &#xD3; Tuama, Tim and Lucille from the L&#x2019;Arche Preston Community, and Charlotte Overton-Hart who founded Story Chaplain, a social enterprise which uses the arts and storytelling to create meaningful moments with people living with dementia.<br> <br> In a world that values winning and coming first, L&#x2019;Arche Communities are places where people can discover who they are, not just what they can do."},{"title":"Out at Greenbelt","details":{"location":"Foundry","day":"Saturday","time":"22:30"},"desc":"A conversation for LGBTQ+ people to be able to share the struggles and joys in wanting to belong to and serve a church that has often and still often rejects them. Don&#x2019;t expect moaning and griping. Expect instead joy, encouragement and celebration in the face of years of neglect. Expect to feel included, noticed, listened to and loved. Whoever you love.<br> <br> Hosted by Tracey Byrne, P&#xE1;draig &#xD3; Tuama and the Out at Greenbelt team"}]}