{"url":"https://www.greenbelt.org.uk/artists/sami-awad/","slug":"sami-awad","name":"Sami Awad","image":"https://s3-us-west-2.amazonaws.com/marcato.west/artists_files/web_photos/675876/original.jpg","twitter":"https://twitter.com/Sami_Awad","shows":[{"title":"A Beginners Guide To Israel-Palestine","details":{"location":"Foundry","day":"Saturday","time":"18:00"},"desc":"With Sami Awad and Amos Trust<br> Greenbelt is always banging on about &#x2018;The Occupation&#x2019; and equal rights for Palestinians and Israelis. But what if you don&#x2019;t have a clue about why? This conversation is for all those who want a whistle-stop intro to one of the world&#x2019;s most intractable, long-lasting struggles for justice &#x2013; where all questions are welcomed and no one need feel silly."},{"title":"Communion","details":{"location":"Glade Big Top","day":"Sunday","time":"09:30"},"desc":"Ah Christmas time, mistletoe and wine... no, we&#x2019;re afraid Sir Cliff isn&#x2019;t joining us this year, but in his absence we&#x2019;re pulling out all our Christmas crackers, and laying on a feast. <br> <br> The way we read and tell the Christmas story is so often sentimentalised, and sugary. But at heart it&#x2019;s a story of revolution and insurgency. The story of the peasant baby that threatened an empire. So this year we&#x2019;ll be tugging the tail of our own empire state of mind, and &#x2018;re-membering&#x2019; Christmas together. <br> <br> Our service will incorporate some familiar aspects of the British Christmas, including the Nativity Play, the Queen&#x2019;s Speech, andeven a lovely Carol (thanks for coming Carol!) <br> <br> For our Christmas Dinner, we&#x2019;ll share the very basic elements of bread and wine, common to cultures around the world. Gluten free and non-alcoholic options will of course be available, please bring a cup.<br> <br> It would be extraordinary if we were to neglect to remember the present day reality of the &#x2018;little town&#x2019; of Jesus&#x2019; birth, a placewhere people still know occupation and oppression, so yes Palestine will also feature in our service. Our music will be led by DJ and Percussionist Sekrit with Mishael Lazarus on vocals. We will be joined by a cast of colourful characters (human and non-human), including John Bell, Liz Adekunle, Sami Awad, Nadia Bolz-Weber. And an angel.<br> <br> Dress for the season if you wish, but otherwise, just come as you are: and be ready for one or two surprises.<br> <br> Gather from 9.30 onward for Christmas party fun and games with Christian Aid and from 10.00 onward for music and warm-ups for a 10.30 service start time. And watch out for the Christmas characters around site."},{"title":"Taste and See","details":{"location":"Table","day":"Sunday","time":"12:30"},"desc":"Palestinians always say: &#x201C;come and see&#x201D;. And that&#x2019;s why it&#x2019;s so good to be friends with Amos Trust &#x2013; because they enable us to take Greenbelters to see for themselves the &#x2018;facts on the ground&#x2019;, to meet the &#x2018;living stones&#x2019;. In this session, Greenbelters who&#x2019;ve been on trips this year &#x2013; to the West Bank and Gaza &#x2013; share their experiences as we rustle up some more classic Palestinian hospitality and dishes with Sami Awad and others.<br> <br> With Sami Awad, Amos Trust, Ben Solanky and Luma"},{"title":"Beyond The Two-State Solution: Peace, Justice & Equality In The Holy Land","details":{"location":"Treehouse","day":"Sunday","time":"18:30"},"desc":"Many are still engaged in fighting for the two-state solution and others are obsessed with figuring out what the Trump Plan is. While the occupation of Palestinians continues and suffering seems to have no end, what is next? Where are we going and what can each of us do to manifest a new vision of peace and justice in the Holy Land?<br> <br> From a Palestinian refugee family, Sami Awad is an internationally acclaimed speaker and executive director of Holy Land Trust."},{"title":"Get Your Freekeh On","details":{"location":"Table","day":"Monday","time":"10:30"},"desc":"It&#x2019;s Monday. It must be soup! Sami Awad from Holy Land Trust in Bethlehem, together with Chris Rose and Katie Hagley from Amos Trust, will cook some traditional Palestinian peasant dishes &#x2013; Freekeh Soup and Shorabat Addas &#x2013; and talk about what solidarity means, when Palestine is on its knees.<br>"}]}