{"url":"https://www.greenbelt.org.uk/artists/danny-dorling/","slug":"danny-dorling","name":"Danny Dorling","image":"https://s3-us-west-2.amazonaws.com/marcato.west/artists_files/web_photos/653156/original.jpg","twitter":"https://twitter.com/dannydorling","shows":[{"title":"What’s So Funny About Brexit?","details":{"location":"Treehouse","day":"Sunday","time":"12:30"},"desc":"Professor Danny Dorling argues that the vote to leave the EU was the last gasp of the old empire working its way out of the British psyche, fuelled by misplaced nostalgia and profound anxiety. Is there a bright side?<br> <br> Oxford University geography professor Danny Dorling is co-author with Sally Thompson of Rule Britannia: Brexit and the End of Empire."},{"title":"Taking The Pulse Of The Nation’s Wellbeing: Is GDP The Best Measure?","details":{"location":"Exchange","day":"Sunday","time":"17:00"},"desc":"Paul Mason and Danny Dorling in conversation about broken promises, widening gaps between rich and poor, the gig economy and where next for our divided nations? Does enterprise offer any hope or ways forward. Or do we need to set a course for a completely post-capitalist future where the nation&#x2019;s success will be gauged by things other than what it makes and sells?<br> <br> Oxford University geography professor Danny Dorling is co-author with Sally Thompson of Rule Britannia: Brexit and the End of Empire.<br> <br> Paul Mason is a writer, broadcaster and film-maker who speaks on the areas of economics, globalisation and the future of capitalism."},{"title":"Brexit Through The Gift Shop","details":{"location":"Foundry","day":"Sunday","time":"19:00"},"desc":"Trick or treat? For Remainers it will be the most frightening Halloween ever. For Brexiteers it will be the best night of their lives. There&apos;s no doubting that Brexit has divided our country as never before. Join Danny Dorling in a small group conversation about what we face this autumn as the UK heads towards the (next) deadline and explore how we can be bridge-builders in our riven and unequal communities."},{"title":"Peak Inequality and Food Bank Use","details":{"location":"Treehouse","day":"Monday","time":"09:30"},"desc":"The Trussell Trust&#x2019;s CEO Emma Revie will be talking with Danny Dorling on his latest book Peak Inequality, and how we can create a future without the need for food banks in the UK."}]}