{"url":"https://www.greenbelt.org.uk/artists/balaklava-blues-presented-by-belarus-free-theatre/","slug":"balaklava-blues-presented-by-belarus-free-theatre","name":"Balaklava Blues presented by Belarus Free Theatre","image":"https://s3-us-west-2.amazonaws.com/marcato.west/artists_files/web_photos/668837/original.jpg","twitter":"https://twitter.com/BFreeTheatre","shows":[{"title":"Balaklava Blues","details":{"location":"Playhouse","day":"Sunday","time":"16:45"},"desc":"Accompanied by mind-blowing visuals, Balaklava Blues transports you into the heart of war-torn Ukraine with electrifyingly cathartic and impossibly danceable tunes. Astounding vocals are accompanied by documentary footage from the front lines, black and white archival material and popular soviet cartoons.<br> <br> Mark and Marichka Marczyk met and fell in love during Ukraine&#x2019;s Revolution of Dignity and are co-founders of the infamous Lemon Bucket Orkestra. Belarus Free Theatre is an international award-winning theatre company founded on principles of freedom of speech and artistic expression.<br> Duration: 60 mins <br> Age Recommendation: 12+ (contains content that some people may find distressing)."},{"title":"Is Protest Art Just Propaganda? Or Is All Art A Form Of Protest?","details":{"location":"Pagoda","day":"Sunday","time":"20:00"},"desc":"A group of leading arts activists at the festival chew the fat about whether art is just a reflection of life and the world in which we live, or a lens that can effect change in the world and in the lives it reflects.<br> <br> With Natalia Kaliada of Belarus Free Theatre, Michael Leunig, Debbie Lewer and chaired by Ruth Daniel of In Place of War."},{"title":"Art vs Fascism","details":{"location":"Foundry","day":"Monday","time":"12:00"},"desc":"With Belarus Free Theatre <br> &#x201C;Freedom does not exist unless we fight for it every day.&#x201D; Those are the words Pussy Riot left us with last year at Greenbelt. Join a conversation about how artistry and creativity might be our most powerful tools in our fight against totalitarianism with the world&#x2019;s bravest theatre company as hosts. <br> For all those using their artistry and creativity to fight injustice where they are.<br> <br> Belarus Free Theatre (BFT) is a UK-based international award-winning theatre company founded on principles of freedom of speech and artistic expression."}]}