{"url":"https://www.greenbelt.org.uk/artists/scm/","slug":"scm","name":"SCM","image":"https://www.greenbelt.org.uk/wp-content/uploads/2019/07/SCM.jpg","twitter":"https://twitter.com/SCM_Britain","shows":[{"title":"Mental Health at Uni","details":{"location":"Foundry","day":"Saturday","time":"12:00"},"desc":"Calling all students and soon-to-be students! Come and hang out with the Student Christian Movement (SCM) and friends to chat about mental health at university. We will talk openly together about the importance of looking after yourself, share some self-care top tips and show off some of our new resources created with our friends at SpaceToBreathe. This panel style discussion will have plenty of time for questions and input."},{"title":"Going to Uni","details":{"location":"Engine","day":"Saturday","time":"14:00"},"desc":"Heading to University soon and not sure what to expect? Wondering what being a Christian at uni is really like?<br> <br> Being at Uni can often be built up as a make-or-break time in our personal faith journeys, so we want to help find a bit of clarity in the chaos. Come along to ask our panel of students from all over the UK about their wide range of experiences. We&#x2019;ll talk finding friends, minimising stress, the importance of finding community and other ways to live &#x2018;life to the full&#x2019; at uni."},{"title":"Student Meet-up","details":{"location":"Jesus Arms","day":"Saturday","time":"18:00"},"desc":"A great opportunity to meet and chat with other<br> students, graduates and freshers in an informal<br> environment. This event is hosted by the<br> Student Christian Movement (SCM).<br> SCM is a student-led movement committed to<br> deepening faith, seeking justice, celebrating<br> diversity and creating community. So feel free<br> to come and join us!<br> In association with SCM"},{"title":"Student Meet-up","details":{"location":"Jesus Arms","day":"Sunday","time":"18:00"},"desc":"A great opportunity to meet and chat with other <br> students, graduates and freshers in an informal <br> environment. This event is hosted by the <br> Student Christian Movement (SCM). <br> SCM is a student-led movement committed to <br> deepening faith, seeking justice, celebrating <br> diversity and creating community. So feel free <br> to come and join us! <br> In association with SCM"},{"title":"Student Meet-up","details":{"location":"Jesus Arms","day":"Monday","time":"18:00"},"desc":"A great opportunity to meet and chat with other <br> students, graduates and freshers in an informal <br> environment. This event is hosted by the <br> Student Christian Movement (SCM). <br> SCM is a student-led movement committed to <br> deepening faith, seeking justice, celebrating <br> diversity and creating community. So feel free <br> to come and join us! <br> In association with SCM"}]}