{"url":"https://www.greenbelt.org.uk/artists/extinction-rebellion/","slug":"extinction-rebellion","name":"Extinction Rebellion","image":"https://s3-us-west-2.amazonaws.com/marcato.west/artists_files/web_photos/664941/original.jpg","twitter":"https://twitter.com/ExtinctionR","shows":[{"title":"Climate Emergency? What does that mean? And what are XRs demands?","details":{"location":"Hot House","day":"Saturday","time":"18:00"},"desc":"Climate Change and ecological collapse has been on the edges of public consciousness for decades so why has it become so important at this moment in history? In this session we will explore some of the narrative that is highlighting the urgency and emergency &#x2013; what has brought XR to its place of mass non-violent direct action and what is it demanding of Governments&#x2026;<br> <br> Mothiur Rahman, (Coordinator for XR Vision Sensing Team, Member of XR Political Circle)  Rob Husband (Co-Founder of XR Banbury, Member of XR Vision Sensing Team) and Marcus Simmons (XR Banbury).<br> <br> Extinction Rebellion is a socio-political movement intending to utilise non-violent disobedience in order to avert climate breakdown."},{"title":"Climate Change – When Hope Is Not Enough!","details":{"location":"Engine","day":"Sunday","time":"19:00"},"desc":"A talk addressing climate science and the pivotal role that young people play in provoking global change. For young people looking for ways to make a difference for the sake of all of our futures. <br> <br> With Isaac Husband (XR, School strikes)<br> <br> Extinction Rebellion is a socio-political movement intending to utilise nonviolent disobedience in order to avert climate breakdown."},{"title":"Radical action  Part 1: XRs methodology and how to get involved","details":{"location":"Hot House","day":"Sunday","time":"12:30"},"desc":"History is full of examples of change, transformation and liberation brought about through Non-violent direct action led by faith communities. How can you get involved in the current push for the UK government to take the necessary immediate action to mitigate for ecological and societal collapse.<br> <br> Mothiur Rahman (Coordinator for XR Vision Sensing Team, Member of XR Political Circle)  Ruth Jarman (CCA), Holly-Anna Petersen (XR Activists)<br> <br> Extinction Rebellion is a socio-political movement intending to utilise nonviolent disobedience in order to avert climate breakdown."},{"title":"Radical action Part 2: High level Non Violent Direct Action and Civil Disobedience","details":{"location":"Hot House","day":"Monday","time":"13:30"},"desc":"A chance to understand, explore and theologise over some of XRs most Radical planned actions<br> <br> Roger Hallam (Co-founder XR) Holly-Anna Petersen (XR Activist) Richard Barnard (XR Activist)<br> <br> Extinction Rebellion is a socio-political movement intending to utilise nonviolent disobedience in order to avert climate breakdown."},{"title":"Debate: Are we really facing a climate emergency?","details":{"location":"Christian Aid Presents&#x2026;","day":"Monday","time":"11:00"},"desc":"And if so, what can we do about it? Our panellists from Christian Aid, Extinction Rebellion, A Rocha and Climate Stewards will inspire and equip you to take urgent action. And once you&#x2019;ve been inspired, stay with us and join the protest&#x2026;"},{"title":"Resist to Exist","details":{"location":"Pagoda","day":"Monday","time":"15:30"},"desc":"There is a long history of citizens resisting injustice by withdrawing aspects of their legal cooperation with the State. This panel debates the ethics of civil disobedience and asks: is it ever OK to break the law if the law is meant to protect and defend our rights? From the Palestinians of Beit Sahour withholding their taxes during the first intifada to Extinction Rebellion blocking London bridges today, what are the rights and wrongs of being civilly disobedient?<br> <br> With Skeena Rathor (Co-ordinator of XRs Vision Sensing Team and member of XRs Political Circle), The Fracking Nanas, The Bishop of Chelmsford, Stephen Cottrell (who spoke on behalf of the Stansted 15 in court), Ruth Jarman (Christian Climate Action), and chaired by Greenbelt trustee Rhian Roberts"},{"title":"So where do we go from here?","details":{"location":"Hot House","day":"Monday","time":"18:00"},"desc":"We&#x2019;ve partied. We&#x2019;ve protested. But what do we do now with all that we&#x2019;ve wrestled with this weekend on the climate catastrophe that faces us if we just stick to business as usual? As we head back to our communities and workaday lives, how can we stay strong and part of this movement for positive and urgent change? Group hug? It needs to be more than that.<br> <br> With Extinction Rebellion, The Anti-Fracking Nanas, Jo Chambelain from Christian Aid, and Ruth Jarman from Christian Climate Action."}]}