{"url":"https://www.greenbelt.org.uk/artists/out-at-greenbelt/","slug":"out-at-greenbelt","name":"OUT at Greenbelt","image":"https://s3-us-west-2.amazonaws.com/marcato.west/artists_files/web_photos/684410/original.jpg","twitter":"http://www.twitter.com/outatgreenbelt","shows":[{"title":"OUT at Greenbelt Welcome","details":{"location":"Forge","day":"Friday","time":"18:30"},"desc":"OUT for the first time: If you identify at LGBTQ+ and are new to Greenbelt, or if you&#x2019;re recently out and don&#x2019;t yet know many people in our community, then don&#x2019;t miss this welcome session especially for you. Meet other festivalgoers, hear about Greenbelt&#x2019;s impressive queer programming, and find your way round the festival site so you don&#x2019;t miss anything once the main events kick off over the weekend. We&#x2019;ll meet in the Forge venue, leaving there at 7.00pm for a walk round the site, finishing at the Foundry at 8.00pm &#x2013; join us there if you can&#x2019;t make it earlier."},{"title":"OUT at Greenbelt Eucharist","details":{"location":"Shelter","day":"Saturday","time":"17:00"},"desc":"OUT eucharist: a very special service of holy communion for LGBTQ+ people and our friends, where you don&#x2019;t need to hide from yourself, each other or God. Everyone is welcome.<br> <br> Greenbelt is proud to be an LGBTQ+ affirming space, and OUT is our volunteer team who help the queer community and our allies get the most out of the festival."},{"title":"Out at Greenbelt","details":{"location":"Foundry","day":"Saturday","time":"22:30"},"desc":"A conversation for LGBTQ+ people to be able to share the struggles and joys in wanting to belong to and serve a church that has often and still often rejects them. Don&#x2019;t expect moaning and griping. Expect instead joy, encouragement and celebration in the face of years of neglect. Expect to feel included, noticed, listened to and loved. Whoever you love.<br> <br> Hosted by Tracey Byrne, P&#xE1;draig &#xD3; Tuama and the Out at Greenbelt team"},{"title":"Lived Out Love","details":{"location":"Treehouse","day":"Saturday","time":"18:15"},"desc":"The Christian Church remains dangerously divided on issues of sexuality and gender identity, and it&#x2019;s LGBTQ+ people that are caught in the crosshairs. This session explores some of the reasons for this conflict, seeks to challenge the status quo, and will equip and enable you to push for change at a grassroots level.<br> <br> With Out at Greenbelt and OneBodyOneFaith"},{"title":"LGBT+ SINGLES SOCIAL","details":{"location":"Jesus Arms","day":"Sunday","time":"19:00"},"desc":"Are you single and ready to meet someone new? Come along for an easy, relaxed, low-pressure chance to connect with other single LGBTQ+ Christians.<br> In association with Christian Connection and in partnership with OUT at Greenbelt (formerly OuterSpace)"},{"title":"LGBT+ Community Meetup","details":{"location":"Jesus Arms","day":"Sunday","time":"20:00"},"desc":"A chance to connect with other LGBTQIA+ Greenbelters. Whether you&apos;re here for the first time or a seasoned Greenbelter looking forward to reconnecting with old friends, we&apos;d love to see you.<br> Run by OUT at Greenbelt (formerly OuterSpace)"}]}