{"url":"https://www.greenbelt.org.uk/artists/modern-church/","slug":"modern-church","name":"Modern Church","image":"https://www.greenbelt.org.uk/wp-content/uploads/2019/07/modern-church.jpg","twitter":"https://twitter.com/ModernChurchUK","shows":[{"title":"A Shameless Conversation #1","details":{"location":"Glade Big Top","day":"Saturday","time":"10:30"},"desc":"Lutheran pastor and writer Nadia Bolz Weber chews the fat with her old friend P&#xE1;draig &#xD3; Tuama<br> <br> Just why has the church got its proverbial knickers in such a twist about human sexuality above all else all these centuries? Isn&#x2019;t it time we all got over it? Isn&#x2019;t it time for a second Reformation that turns sexual harm into sexual healing?<br> <br> Expect wit, wisdom, love, laughter. And a whole new, holistic way of seeing yourself in church and before God.<br> <br> With the generous support of Canterbury Press and Modern Church."},{"title":"In Conversation with Michael Leunig","details":{"location":"Pagoda","day":"Saturday","time":"09:30"},"desc":"Michael Leunig has been drawing newspaper cartoons for fifty years. His work explores political folly, human nature, spiritual life, mature innocence and the divine creaturely self. Join him in conversation as he discusses a long career in an ever-changing world. <br> <br> Michael Leunig is a cartoonist, writer, painter, philosopher and poet who&apos;s commentary on political, cultural and emotional life spans more than forty years.<br> In conversation with Malcolm and Meryl Doney. <br> <br> In association with Modern Church."},{"title":"Art School: Michael Leunig Masterclass","details":{"location":"Studio","day":"Saturday","time":"16:15"},"desc":"A wonderful opportunity to explore an alternative approach to art that values humour and playful spontaneity. Michael Leunig invites us to search for a connection to our lost holy fool, the archetypal personification of creativity&apos;s wellspring.<br> <br> Michael Leunig is a cartoonist, writer, painter, philosopher and poet who&apos;s commentary on political, cultural and emotional life spans more than forty years.<br> Places Limited: first come first serve<br> In association with Modern Church."},{"title":"Michael Leunig In Conversation with You and Himself as he draws live","details":{"location":"Playhouse","day":"Sunday","time":"13:00"},"desc":"Michael&#x2019;s fifty+ years of newspaper work has explored politics, the human psyche, nature and spirituality. In 1999 he was declared a national living treasure by the Australian National Trust; an award he finds both peculiar and amusing. Join Michael in conversation with himself and you, his audience, as he draws live.<br> <br> Michael Leunig is a cartoonist, writer, painter, philosopher and poet who&apos;s commentary on political, cultural and emotional life spans more than forty years.<br> <br> In association with Modern Church."},{"title":"A Shameless Conversation #2","details":{"location":"Glade Big Top","day":"Monday","time":"11:30"},"desc":"Lutheran pastor and writer Nadia Bolz-Weber chews the fat with priest and poet Rachel Mann<br> <br> Just why has the church got its proverbial knickers in such a twist about human sexuality above all else all these centuries? Isn&#x2019;t it time we all got over it? Isn&#x2019;t it time for a second Reformation that turns sexual harm into sexual healing?<br> <br> Expect wit, wisdom, love, laughter. And a whole new, holistic way of seeing yourself in church and before God.<br> <br> With the generous support of Canterbury Press and Modern Church."},{"title":"Personal Spirituality with Michael Leunig","details":{"location":"Shelter","day":"Monday","time":"09:30"},"desc":"&#x201C;Give unto Caesar what is Caesar&#x2019;s but give your art to God&#x201D; <br> Cartoonist, artist, philosopher and poet Michael Leunig often explores the idea of an innocent and sacred personal inner world. Join Michael as he discusses struggle, redemption and transcendence in his creative process. <br> <br> Michael Leunig is a cartoonist, writer, painter, philosopher and poet who&apos;s commentary on political, cultural and emotional life spans more than forty years.<br> <br> In association with Modern Church."}]}